general/general.org
#+title: General configurations for the Emacs env
* Personal configs
** Info
   #+begin_src emacs-lisp
     (setq-default user-full-name "Jefter Santiago")
     (setq-default user-mail-address "jeftersantiago@protonmail.com")
     (load "~/Dropbox/private-configs/private.el")
   #+end_src
** Custom file
    Separated file to store generated config from emacs.
    Puts the outputs in a separated file.

    Taken from:
    - https://www.reddit.com/r/emacs/comments/4x655n/packageselectedpackages_always_appear_after/
    - https://www.reddit.com/r/emacs/comments/53zpv9/how_do_i_get_emacs_to_stop_adding_custom_fields/
   #+begin_src emacs-lisp
     (setq custom-file "~/.emacs.d/custom.el")
   #+end_src
* Backup disabled
   #+begin_src emacs-lisp
     (setq-default backup-inhibited t)
     (setq-default create-lockfiles nil)
     (setq-default make-backup-files nil)
   #+end_src
* Automatic package updates
  Automatizating the =M-x auto-package-update-now= command.
   #+begin_src emacs-lisp
     (use-package auto-package-update
       :ensure t
       :custom
       (auto-package-update-interval 7)
       (auto-package-update-prompt-before-update t)
       (auto-package-update-hide-results t)
       :config
       (auto-package-update-maybe))
   #+end_src
* No auto-save
   Do not create the ~auto-save/~ folder
   #+begin_src emacs-lisp
     (use-package no-littering :ensure t )

     ;; no-littering doesn't set this by default so we must place
     ;; auto save files in the same path as it uses for sessions
     (setq auto-save-file-name-transforms
           `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
   #+end_src

